# SetSketchyLines Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..SetSketchyLines Method
View Class See Also
---
Sets the sketchy lines settings for the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void SetSketchyLines(
	ViewDisplaySketchyLines sketchyLines
)
```

Visual Basic
---
```text
Public Sub SetSketchyLines ( _
	sketchyLines As ViewDisplaySketchyLines _
)
```

Visual C++
---
```text
public:
void SetSketchyLines(
	ViewDisplaySketchyLines^ sketchyLines
)
```

# ### Parameters
sketchyLines
    Type: Autodesk.Revit.DB..::..ViewDisplaySketchyLines Sketchy Lines settings to set.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This view does not contain display-related properties. |

# See Also
View Class
Autodesk.Revit.DB Namespace